Repository: 84000/translation-memory-resources
Catalog: post_input/toh101.bo.en.tmx
Source language: bo
Languages: en

source: བཅོམ་ [61a] ལྡན་ འདས་ བཅོམ་ལྡན་འདས་ ལ་ དེ་བཞིན་ གཤེགས་པ་ ངེས་པ ར་ འདྲེན་པ འི་ རྒྱལ་མཚན་ གནོད་པ་ ཆུང་ ངམ །_ ཉམ་ང་བ་ ཉུང་ ངམ །_ བསྐྱོད་པ་ ཡང་ ངམ །_ སྟོབས་ དང་ བདེ་བ ར་ རེག་པ་ ལ་ གནས་ སམ །_ ཞེས་ སྙུན་ གསོལ་ ཞིང་ །_
en: “Blessed One, the thus-gone Banner of Certain Guidance inquires whether you have encountered but little hardship or discomfort, and whether you remain healthy, strong, and at ease.

source: བཅོམ་ལྡན་འདས་ ལ་ བཅོམ་ ལྡན་འདས་ དེས་ ཀ་ ཤི་ ཀ འི་ གོས་ འདི་ ཡང་ བསྐུར་བ་ ལགས་སོ །_།
en: He also sends you this garment of Kāśi silk.”

source: བཅོམ་ལྡན་འདས་ ཀྱིས་ ཀ་ ཤི་ ཀ འི་ གོས་ དེ་ བཞེས་ ཏེ |#| བཞེས་ ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ རིན་པོ་ཆེ འི་ གོ་ཆ་ མཐའ་ ཡས་ལ་ འདི་སྐད་ ཅེས་ བཀའ་ སྩལ་ ཏོ །_།
en: $371 The Blessed One received the garment and then asked the bodhisattva great being Infinite Jewel Armor,

source: རིན་པོ་ཆེ འི་ གོ་ཆ་ མཐའ་ ཡ ས་ ཅི་ བཅོམ་ལྡན་འདས་ དེ་ སྙུན་ མི་ མངའའམ །_ སྟོབས་ དང་ ལྡན་ ནམ །_ བདེ་བ་ དང་ ལྡན་ ནམ །_ འགྱུར་བ་ མི་ མངའའམ །_
en: “Infinite Jewel Armor, has that blessed one encountered but little harm, is he strong and happy, and does he remain unchanged?”

source: དེ འི་ ཚེ་ ཤར་ཕྱོགས་ སུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ གྲངས་མེད་པ་ སུམ་ ཁྲི་ བདུན་ སྟོང་ འདས་པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ མེ་ཏོག་ པད་མ་ ཞེས་ བྱ་བ་ ཡོད་ དེ
en: $372 At that time there was in the east, beyond thirty-seven thousand innumerable universes, a universe known as Lotus Flower , and

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ སྣ་ཚོགས་ མེ་ཏོག་ ཚོགས་ ཀྱི་ དཔལ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: within it resided a thus-gone one, a worthy one, a perfect buddha called Splendor of Diverse Flowers.

source: བཅོམ་ལྡན་འདས་ དེ་བཞིན་ གཤེགས་པ་ དེས་ ཀྱང་ བྱང་ཆུབ་ སེམས་དཔའ་ བརྩོན་འགྲུས་ མཐའ་ ཡ ས་ ཞེས་ བྱ་བ་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་ ཏོ །_།
en: This blessed thus-gone one had prophesied that a bodhisattva known as Anantavīrya would awaken to unsurpassable and perfect buddhahood.

source: བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ བརྩོན་འགྲུས་ མཐའ་ ཡ ས་ ཀྱིས་ སྣང་བ་ ཆེན་པོ་ དེ་ མཐོང་ སྟེ །_ |#| གསུང་ བསལ་བ འི་ སྒྲ་ དེ་ཡང་ ཐོས་ སོ །_།
en: Also this bodhisattva great being, Anantavīrya , had noticed the great light and heard the sound of the clear voice.

source: དེ་ནས་ བཅོམ་ལྡན་འདས་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ སྣ་ཚོགས་ མེ་ཏོག་ ཚོགས་ ཀྱི་ དཔལ་ ལ་ བྱང་ཆུབ་ སེམས་དཔའ་ བརྩོན་འགྲུས་ མཐའ་ ཡ ས་ ཀྱིས་ འདི་སྐད་ ཅེས་ གསོལ་ ཏོ །_།
en: Now he inquired of the blessed one, the thus-gone one, the worthy one, the perfect buddha Splendor of Diverse Flowers,

source: བཅོམ་ལྡན་འདས་ མཐུ་ དེ་ སུ འི་ ལགས །_
en: “Blessed One, whose power is this?”

source: རིགས་ ཀྱི་ བུ་ ནུབ་ཕྱོགས་ སུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ གྲངས་མེད་པ་ སུམ་ ཁྲི་ བདུན་ སྟོང་ འདས་པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ ཅེས་བྱ་བ་ ཡོད་ དེ
en: $373 “Noble son,” |#| “in the west, beyond thirty-seven thousand innumerable universes lies a buddha realm known as Enduring.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ ཤཱཀྱ་ ཐུབ་པ་ ཞེས་ བྱ་བ་ བཞུགས་ [61b] ཏེ་
en: Within it resides the thus-gone one, the worthy one, the perfect buddha Śākyamuni. [61.b]

source: འཚོ་ ཞིང་ གཞེས་ ལ་ འདི་ལྟ་སྟེ །_ |#| བྱང་ཆུབ་ སེམས་དཔ འི་ སྡེ་སྣོད་ ཅེས་བྱ་བ་ ཆོས་ ཀྱི་ རྣམ་ གྲངས་ ཀྱི་ ཆོས་ ཀྱང་ སྟོན་ ཏེ །_
en: Abiding and remaining present there, he is delivering Dharma teachings that are known as the Bodhisattva Collection.

source: མཐུ་ དེ་ ནི་ དེ འི་ ཡིན་ ནོ །_།
en: What you witness is his power.”

source: དེ་ནས་ བཅོམ་ལྡན་འདས་ དེ་ ལ་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ བརྩོན་འགྲུས་ མཐའ་ ཡ ས་ ཀྱིས་ འདི་སྐད་ ཅེས་ གསོལ་ ཏོ །_།
en: $374 The bodhisattva Anantavīrya then addressed that blessed one,

source: བཅོམ་ལྡན་འདས་ བཅོམ་ལྡན་འདས་ ཤཱཀྱ་ ཐུབ་པ འི་ ཐད་ དུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ དེར་ བདག་ མཆི་བ ར་ བགྱི འོ །_།
en: “Blessed One, I wish to journey to that universe and go before the blessed Śākyamuni.”

source: དེ་ནས་ དེ་བཞིན་ གཤེགས་པ་ སྣ་ཚོགས་ མེ་ཏོག་ ཚོགས་ ཀྱི་ དཔལ་ གྱིས་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ བརྩོན་འགྲུས་ མཐའ་ ཡ ས་ ཀྱི་ ལག་པ ར་ པད་མ་ ཆེན་པོ་ ཞིག་ བྱིན་ ཏེ
en: Then the blessed one Splendor of Diverse Flowers placed a great lotus flower in the bodhisattva Anantavīrya ’s hand and said,

source: ང འི་ ཚིག་ གིས་ གནོད་པ་ ཆུང་ ངམ །_ ཉམ་ང་བ་ ཉུང་ ངམ །_ བསྐྱོད་པ་ ཡང་ ངམ །_ སྟོབས་ དང་ བདེ་བ ར་ རེག་པ་ ལ་ གནས་ སམ་ ཞེས་ སྙུན་ གསོལ་ ཅིག _།
en: ask him on my behalf whether he has encountered but little hardship or discomfort, and whether he remains healthy, strong, and at ease.”

source: དེ་ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ བརྩོན་འགྲུས་ མཐའ་ ཡ ས་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ སྣ་ཚོགས་ མེ་ཏོག་ ཚོགས་ ཀྱི་ དཔལ་ གྱི་ ཞབས་ ལ་ ཕྱག་ འཚལ་ ཏེ་ |#| བསྐོར་བ་ བྱས་ ནས |#| འདི་ལྟ་སྟེ་ དཔེར་ན་ སྐྱེས་བུ་ སྟོབས་ དང་ ལྡན་པ་ ཞིག་ གིས་ ལག་པ་ བསྐུམ་པ་ རྐྱོང་བ ར་ བྱེད་པ འམ །_ ལག་པ་ བརྐྱང་བ་ སྐུམ་པ ར་ བྱེད་པ འི་ སྐད་ཅིག་ དང་ ཐང་ ཅིག་ དང་ །_ ཡུད་ཙམ་ དེས་ སོང་ སྟེ |#| སངས་རྒྱས་ ཀྱི་ ཞིང་ དེ་ནས་ མི་སྣང་བ ར་ གྱུར་ ནས་ འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ དུ་ འདུག་ གོ །_།
en: $376 The bodhisattva Anantavīrya then bowed his head to the feet of the thus-gone one, the worthy one, the perfect buddha Splendor of Diverse Flowers, circumambulated him, and left. |#| Having disappeared from that buddha realm he emerged all at once, in one instant and in one moment, in the world of Enduring, as fast as an athlete can stretch out or bend an arm.

source: དེ་ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ བརྩོན་འགྲུས་ མཐའ་ ཡ ས་ རྒྱལ་པོ འི་ ཁབ་ ཀྱི་ གྲོང་ཁྱེར་ ཆེན་པོ་ ག་ལ་བ་ དང་ །_ འོད་མ འི་ ཚལ་ བྱ་ ཀ་ ལན་ ད་ ཀ་ གནས་པ་ ག་ལ་བ་ དེར་ སོང་ སྟེ་
en: The bodhisattva great being Anantavīrya then proceeded to the city of Rājagṛha and the Kalandaka­nivāpa in the Veṇuvana.

source: ཕྱིན་ ནས |#| བཅོམ་ལྡན་འདས་ ཀྱི་ ཞབས་ ལ་མགོ་ བོས་ ཕྱག་ འཚལ་ ཏེ་ ཕྱོགས་ གཅིག་ ཏུ་ འདུག་ གོ །_། |#| ཕྱོགས་ གཅིག་ ཏུ་ འདུག་ ནས་ ཀྱང་ བཅོམ་ལྡན་འདས་ ལ་ འདི་སྐད་ ཅེས་ གསོལ་ ཏོ །_།
en: There he bowed his head to the feet of the Blessed One and, standing to one side, addressed the Blessed One:

source: བཅོམ་ལྡན་འདས་ བཅོམ་ལྡན་འདས་ ལ་ དེ་བཞིན་ གཤེགས་པ་ སྣ་ཚོགས་ མེ་ཏོག་ ཚོགས་ ཀྱི་ དཔལ་ གནོད་པ་ ཆུང་ ངམ །_ ཉམ་ང་བ་ ཉུང་ ངམ །_ བསྐྱོད་པ་ ཡང་ ངམ །_ སྟོབས་ དང་ བདེ་ [62a] བར་ རེག་པ་ ལ་ གནས་ སམ་ ཞེས་ སྙུན་ གསོལ་ ཞིང་ །_
en: “Blessed One, the blessed thus-gone Splendor of Diverse Flowers inquires whether you have encountered but little hardship or discomfort, and whether you remain healthy, strong, [62.a] and at ease.

source: བཅོམ་ལྡན་འདས་ ལ་ བཅོམ་ལྡན་འདས་ དེས་ པད་མ་ ཆེན་པོ་ འདི་ ཡང་ བསྐུར་བ་ ལགས་ ན །_
en: He also sends you this great lotus flower.

source: བཅོམ་ལྡན་འདས་ ཀྱིས་ པད་མ་ འདི་ བཞེས་ སུ་ གསོལ །_
en: Please accept this flower, Blessed One.”

source: བཅོམ་ལྡན་འདས་ ཀྱིས་ པད་མ་ དེ་ བཞེས་ ཏེ །_ |#| བཞེས་ ནས་ ཀྱང་ འདི་སྐད་ ཅེས་ བཀའ་ སྩལ་ ཏོ །_།
en: $377 The Blessed One received the lotus flower and asked,

source: བརྩོན་འགྲུས་ མཐའ་ ཡ ས་ ཅི་ བཅོམ་ལྡན་འདས་ དེ་ སྙུན་ མི་ མངའའམ །_ སྟོབས་ དང་ ལྡན་ ནམ །_ བདེ་བ་ དང་ ལྡན་ ནམ །_ འགྱུར་བ་ མི་ མངའའམ །_
en: “ Anantavīrya , has that blessed one encountered but little harm, is he strong and happy, and does he remain unchanged?”

source: དེ འི་ ཚེ་ ཤར་ཕྱོགས་ སུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ གྲངས་མེད་པ་ སུམ་ ཁྲི་ དྲུག་ སྟོང་ འདས་པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ གདུགས་ གཅིག་པ་ ཞེས་ བྱ་བ་ ཡོད་ དེ
en: $378 At that time there was in the east, beyond thirty-six thousand innumerable universes, a universe known as Single Parasol , and

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ འཇིགས་པ འི་ སྤུ་ ཟིང་ ཞེས་ བྱེད་པ་ དང་ བྲལ་བ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: within it resided a thus-gone one, a worthy one, a perfect buddha called Never Terrified.

source: དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ འཇིགས་པ འི་ སྤུ་ ཟིང་ ཞེས་ བྱེད་པ་ དང་ བྲལ་བ་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ དྲ་བ་ ཅན་ གྱི་ འོད་ ཅེས་བྱ་བ་ བླ་ ན་ |#| མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་ ཏོ །_།
en: This thus-gone one, worthy one, perfect buddha called Never Terrified had prophesied that a bodhisattva known as Jālinīprabha would awaken to unsurpassable and perfect buddhahood.

source: བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ དྲ་བ་ ཅན་ གྱི་ འོད་ ཀྱིས་ སྣང་བ་ ཆེན་པོ་ དེ་ མཐོང་ སྟེ །_ |#| གསུང་ བསལ་བ འི་ སྒྲ་ དེ་ཡང་ ཐོས་ སོ །_།
en: Also this bodhisattva great being, Jālinīprabha, had noticed the great light and heard the sound of the clear voice.

source: ཐོས་ ནས་ ཀྱང་ བཅོམ་ལྡན་འདས་ ག་ལ་བ་ དེར་ སོང་ སྟེ་ ཕྱིན་ ནས །_ |#| བཅོམ་ལྡན་འདས་ ཀྱི་ ཞབས་ ལ་མགོ་ བོས་ ཕྱག་ འཚལ་ ཏེ་ བཅོམ་ལྡན་འདས་ དེ་ ལ་ འདི་སྐད་ ཅེས་ གསོལ་ ཏོ །_།
en: He therefore went before that blessed one, bowed his head to his feet and asked,

source: རིགས་ ཀྱི་ བུ་ སངས་རྒྱས་ ཀྱི་ ཞིང་ འདི་ ནས་ འཇིག་རྟེན་ གྱི་ ཁམས་ གྲངས་མེད་པ་ སུམ་ ཁྲི་ དྲུག་ སྟོང་ འདས་པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ ཅེས་བྱ་བ་ ཡོད་ དེ
en: $379 “Noble son,” |#| “thirty-six thousand innumerable universes away from here lies a universe known as Enduring.

source: འཚོ་ ཞིང་ གཞེས་ ལ་ འདི་ལྟ་སྟེ །_ |#| བྱང་ཆུབ་ སེམས་དཔ འི་ སྡེ་སྣོད་ ཅེས་བྱ་བ འི་ ཆོས་ ཀྱི་ རྣམ་ གྲངས་ ཀྱི་ ཆོས་ ཀྱང་ སྟོན་ ཏེ །_
en: Abiding and remaining present there, he is delivering the Dharma teachings known as the Bodhisattva Collection.

source: བཅོམ་ལྡན་འདས་ དེ་ ལ་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ དྲ་བ་ ཅན་ གྱི་ འོད་ ཀྱིས་ འདི་སྐད་ ཅེས་ གསོལ་ ཏོ །_།
en: $380 The bodhisattva Jālinīprabha then addressed that blessed one:

source: བཅོམ་ལྡན་འདས་ བཅོམ་ལྡན་འདས་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ ཤཱཀྱ་ ཐུབ་པ་ དེ་ ལ་ བལྟ་ བ་ དང་ །_ ཕྱག་ བགྱི་བ་ དང་ །_ བསྙེན་བཀུར་ བགྱི་བ་ དང་ །_ བསམ་ གྱིས་ མི་ ཁྱབ་པ འི་ གོ་ཆ་ བགོས་པ འི་ བྱང་ཆུབ་ སེམས་དཔའ་ དེ་དག་ ཀྱང་ བལྟ་བ འི་ སླད་ དུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ དེར་ བདག་ མཆི་བ ར་ བགྱི འོ །_།
en: “Blessed One, I wish to go to the world of Enduring so that I may see, venerate, and serve the thus-gone one, the worthy one, the perfect buddha Śākyamuni, and so that I may behold the bodhisattvas who have donned the inconceivable armor.”

source: རིགས་ ཀྱི་ བུ་ དེ འི་ དུས་ ལ་ དབབ་ པ ར་ ཤེས་ ན་ |#| སོང་ ཤིག _།
en: $381 “Noble son,” |#| “if you know that the time has come, then leave.”

source: དེ་ནས་ བཅོམ་ལྡན་འདས་ ཀྱིས་ བྱང་ཆུབ་ སེམས་དཔའ་ དྲ་བ་ ཅན་ གྱི་ འོད་ ལ་ མེ་ཏོག་ ཁ་དོག་ ལྔ་ པས་ ཁལ་ བཅུ་ ཚད་ བཀང་ ནས་ |#| བྱིན་ ཏེ
en: Then that blessed thus-gone one gave the bodhisattva Jālinīprabha ten full bushels of five-colored flowers and said,

source: རིགས་ ཀྱི་ བུ་ ཁྱོད་ ཀྱིས་ བཅོམ་ལྡན་འདས་ དེ་ ལ་ འདི་ ཕུལ་ ལ །_
en: “Noble son, offer this to that blessed one, and

source: ང འི་ ཚིག་ གིས་ བཅོམ་ལྡན་འདས་ གནོད་པ་ ཆུང་ ངམ །_ ཉམ་ང་བ་ ཉུང་ ངམ །_ སྙུན་ མི་ མངའའམ །_ བསྐྱོད་པ་ ཡང་ ངམ །_ སྟོབས་ དང་ ལྡན་ ནམ །_ བདེ་བ ར་ རེག་པ་ ལ་ གནས་ སམ་ ཞེས་ དེ་སྐད་ ཅེས་ སྙུན་ ཡང་ གསོལ་ ཅིག །_
en: ask him on my behalf whether he has encountered but little hardship or discomfort, and whether he remains in good health, healthy, strong, and at ease.”

source: དེ་ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ དྲ་བ་ ཅན་ གྱི་ འོད་ བཅོམ་ལྡན་འདས་ དེ འི་ ཞབས་ ལ་མགོ་ བོས་ ཕྱག་ འཚལ་ ནས་ འདི་ལྟ་སྟེ །_
en: $382 The bodhisattva great being Jālinīprabha then bowed his head to the feet of that blessed one and left.

source: དཔེར་ན་ སྐྱེས་བུ་ སྟོབས་ དང་ ལྡན་པ་ ཞིག་ གིས་ ཞེས་ བྱ་བ་ ནས་ རྒྱས་པ ར་ སྐད་ཅིག་ དང་ །_ ཐང་ ཅིག་ དང་ །_ ཡུད་ཙམ་ དེས་ འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ འདིར་ འདུག་ སྟེ །_
en: Having disappeared from that buddha realm he emerged all at once, in one instant and in one moment, in the world of Enduring, as fast as an athlete can stretch out or bend an arm.

source: དེ་ རྒྱལ་པོ འི་ ཁབ་ འོད་མ འི་ ཚལ་ བྱ་ ཀ་ ལན་ ད་ ཀ་ གནས་པ་ ག་ལ་བ་ དང་ །_ བཅོམ་ ལྡན་འདས་ ག་ལ་བ་ དེར་ སོང་ སྟེ་ |#| ཕྱིན་ ནས །_ |#| བཅོམ་ལྡན་འདས་ ཀྱི་ ཞབས་ ལ་མགོ་ བོས་ ཕྱག་ འཚལ་ ཏེ་ ཕྱོགས་ གཅིག་ ཏུ་ འདུག་ གོ །_།
en: He proceeded to the city of Rājagṛha and the Kalandaka­nivāpa in the Veṇuvana. |#| There he bowed his head to the feet of the Blessed One and sat to one side.

source: ཕྱོགས་ གཅིག་ ཏུ་ འདུག་ ནས་ ཀྱང་ བཅོམ་ལྡན་འདས་ ལ་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ དྲ་བ་ ཅན་ གྱི་ འོད་ ཀྱིས་ འདི་སྐད་ ཅེས་ གསོལ་ ཏོ །_།
en: Then he addressed the Blessed One:

source: བཅོམ་ ལྡན་འདས་ བཅོམ་ལྡན་འདས་ ལ་ དེ་བཞིན་ གཤེགས་པ་ འཇིགས་པ འི་ སྤུ་ ཟིང་ ཞེས་ བྱེད་པ་ དང་ བྲལ་བ་ གནོད་པ་ ཆུང་ ངམ །_ ཉམ་ང་བ་ ཉུང་ ངམ །_ བསྐྱོད་པ་ ཡང་ ངམ །_ སྟོབས་ དང་ བདེ་བ ར་ རེག་པ་ ལ་ གནས་ སམ །_ ཞེས་ སྙུན་ གསོལ་ ཞིང་ །_
en: “Blessed One, the thus-gone Never Terrified inquires whether you have encountered but little hardship or discomfort, and whether you remain healthy, strong, and at ease. [63.a]

source: བཅོམ་ལྡན་འདས་ ལ་ བཅོམ་ལྡན་འདས་ དེས་ [63a] མེ་ཏོག་ ཁ་དོག་ ལྔ་ པས་ བལྟམ་པ འི་ ཁལ་ བཅུ་ ཚད་ འདི་ ཡང་ བསྐུར་བ་ ལགས་ ན །_
en: He also sends you these ten full bushels of five-colored flowers.

source: བཅོམ་ལྡན་འདས་ ཀྱིས་ བཞེས་ སུ་ གསོལ །_
en: Please accept them, Blessed One.

source: བཅོམ་ལྡན་འདས་ ཀྱིས་ བཞེས་ ཏེ་ |#| བཞེས་ ནས་ |#| ཀྱང་ བཀའ་ སྩལ་པ །_
en: Blessed One, please accept them.” |#| $383 The Blessed One received the gift and asked,

source: རིགས་ ཀྱི་ བུ་ ཅི་ བཅོམ་ལྡན་འདས་ དེ་ སྙུན་ མི་ མངའ་ འམ །_ སྟོབས་ དང་ ལྡན་ ནམ །_ བདེ་བ་ དང་ ལྡན་ ནམ །_ འགྱུར་བ་ མི་ མངའའམ །_
en: “Noble son, has that blessed one encountered but little harm, is he strong and happy, and does he remain unchanged?”

source: དེ འི་ ཚེ་ ཤར་ཕྱོགས་ སུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ གྲངས་མེད་པ་ སུམ་ ཁྲི་ ལྔ་ སྟོང་ འདས་པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཤིན་ཏུ་ རྣམ་པར་ དག་པ་ ཞེས་ བྱ་བ་ ན །_
en: $384 At that time there was in the east, beyond thirty-five thousand innumerable universes, a universe known as Suviśuddha, and

source: དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ ཡེ་ཤེས་ ཀྱི་ དཔལ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: within it resided a thus-gone one, a worthy one, a perfect buddha called Jñānaśrī.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ ཡེ་ཤེས་ ཀྱི་ སྟོབས་ ཞེས་ བྱ་བ་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་ ཏོ །_།
en: This blessed one had prophesied that a bodhisattva known as Jñānabala would awaken to unsurpassable and perfect buddhahood.

source: བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ ཡེ་ཤེས་ ཀྱི་ སྟོབས་ ཀྱིས་ སྣང་བ་ ཆེན་པོ་ དེ་ མཐོང་ སྟེ །_ |#| གསུང་ བསལ་བ འི་ སྒྲ་ དེ་ཡང་ ཐོས་ ནས །_
en: Also this bodhisattva great being, Jñānabala, had noticed the great light and heard the sound of the clear voice.

source: དེ་ བཅོམ་ལྡན་འདས་ དེ་བཞིན་ གཤེགས་པ་ ཡེ་ཤེས་ ཀྱི་ དཔལ་ ག་ལ་བ་ དེར་ སོང་ སྟེ །_ |#| བཅོམ་ལྡན་འདས་ དེ འི་ ཞབས་ ལ་ མགོ་ བོས་ ཕྱག་ འཚལ་ ནས །_ |#| བཅོམ་ལྡན་འདས་ དེ་ ལ་ འདི་སྐད་ ཅེས་ གསོལ་ ཏོ །_།
en: He therefore went before the blessed Jñānaśrī, bowed his head to his feet, and asked,

source: བཅོམ་ལྡན་འདས་ སྣང་བ་ ཆེན་པོ་ དེ་ དང་ །_ གསུང་ བསལ་བ འི་ སྒྲ་ ཆེན་པོ་ དེ་ སུ འི་ ལགས་
en: “Blessed One, whose is this great radiance and whose is this powerful clear voice?”

source: རིགས་ ཀྱི་ བུ་ སངས་རྒྱས་ ཀྱི་ ཞིང་ འདི་ ནས་ འཇིག་རྟེན་ གྱི་ ཁམས་ གྲངས་ མེད་པ་ སུམ་ ཁྲི་ ལྔ་ སྟོང་ འདས་པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ ཅེས་བྱ་བ་ ཡོད་ དེ
en: $385 “Noble son,” |#| “thirty-five thousand innumerable universes away from here lies a universe known as Enduring.

source: མཐུ་ དེ་ལྟ་ བུ་ དེ་ ནི་ དེ འི་ ཡིན་ ནོ །_།
en: What you witness is the expression of his power.”

source: བཅོམ་ལྡན་འདས་ བཅོམ་ལྡན་འདས་ དེ་ ལ་ བལྟ་བ་ དང་ །_ ཕྱག་ བགྱི་བ་ དང་ །_ བསྙེན་བཀུར་ བགྱི་བ་ དང་ །_ བསམ་ གྱིས་ མི་ ཁྱབ་པ འི་ གོ་ཆ་ བགོས་པ འི་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་ [63b] དཔའ་ ཆེན་པོ་ དེ་དག་ ཀྱང་ བལྟ་བ འི་ སླད་ དུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ དེར་ བདག་ མཆི་བ ར་ བགྱི འོ །_།
en: “Blessed One, I wish to go to the world of Enduring so that I may see, venerate, and serve the blessed thus-gone Śākyamuni, and so that I may behold [63.b] the bodhisattva great beings who have donned the inconceivable armor.”

source: དེ་ནས་ དེ་བཞིན་ གཤེགས་པ་ ཡེ་ཤེས་ ཀྱི་ དཔལ་ གྱིས་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ ཡེ་ཤེས་ ཀྱི་ སྟོབས་ ལ་ ལག་པ་ ལྟ་བུ འི་ ཨུད་པ་ ལ་ བྱིན་ ཏེ
en: Then the thus-gone Jñānaśrī gave the bodhisattva great being Jñānabala a hand-like utpala flower and said,

source: རིགས་ ཀྱི་ བུ་ ཁྱོད་ ཀྱིས་ བཅོམ་ལྡན་འདས་ དེ་ ལ་ འདི་ ཕུལ་ ལ །_ ཕུལ་ ནས་ |#| ཀྱང་ བཅོམ་ལྡན་འདས་ བཅོམ་ལྡན་འདས་ ལ་ དེ་བཞིན་ གཤེགས་པ་ ཡེ་ཤེས་ ཀྱི་ དཔལ་ གནོད་པ་ ཆུང་ ངམ །_ ཉམ་ང་བ་ ཉུང་ ངམ །_ བསྐྱོད་པ་ ཡང་ ངམ །_ སྟོབས་ དང་ བདེ་བ ར་ རེག་པ་ ལ་ གནས་ སམ་ སྙུན་ གསོལ་ ལོ་ ཞེས་ དེ་སྐད་ ཅེས་ ཀྱང་ གསོལ་ ཅིག _།
en: “Noble son, offer this to that blessed one, and ask him on my behalf whether he has encountered but little hardship or discomfort, and whether he remains healthy, strong, and at ease.”

source: དེ་ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ ཡེ་ཤེས་ ཀྱི་ སྟོབས་ བཅོམ་ལྡན་འདས་ དེ འི་ ཞབས་ ལ་མགོ་ བོས་ ཕྱག་ འཚལ་ ཏེ །_
en: $388 Then the bodhisattva great being Jñānabala bowed his head to the feet of that blessed one and,

source: འདི་ལྟ་སྟེ །_ དཔེར་ ན་ སྐྱེས་བུ་ སྟོབས་ དང་ ལྡན་པ་ ཞིག་ གིས་ ལག་པ་ བསྐུམ་པ་ རྐྱོང་བ ར་ བྱེད་པ འམ །_ ལག་པ་ བརྐྱང་བསྐུམ་ པར་ བྱེད་པ འི་ སྐད་ཅིག་ དང་ ཐང་ ཅིག་ དང་ ཡུད་ཙམ་ དེས་ སོང་ སྟེ་ |#| འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ འདིར་ འདུག་ གོ །_
en: as fast as an athlete can stretch out or bend an arm, he journeyed all at once, in one instant and in one moment, to the world of Enduring.

source: དེ་ རྒྱལ་པོ འི་ ཁབ་ འོད་མ འི་ ཚལ་ བྱ་ ཀ་ ལན་ ད་ ཀ་ གནས་པ་ ག་ལ་བ་ དང་ བཅོམ་ལྡན་འདས་ ག་ལ་བ་ དེར་ སོང་ སྟེ་ ཕྱིན་ ནས །_
en: There he proceeded to Rājagṛha and the Kalandaka­nivāpa in the Veṇuvana.

source: བཅོམ་ལྡན་འདས་ ཀྱི་ ཞབས་ ལ་མགོ་ བོས་ ཕྱག་ འཚལ་ ཏེ །_ |#| ཕྱོགས་ གཅིག་ ཏུ་ འདུག་ གོ །_། |#| ཕྱོགས་ གཅིག་ ཏུ་ འདུག་ ནས་ ཀྱང་ བཅོམ་ལྡན་འདས་ ལ་ བྱང་ཆུབ་ སེམས་དཔའ་ ཡེ་ཤེས་ ཀྱི་ སྟོབས་ ཀྱིས་ འདི་སྐད་ ཅེས་ གསོལ་ ཏོ །_།
en: Having bowed his head to the feet of the Blessed One, he sat to one side, and thus addressed the Blessed One:

source: བཅོམ་ལྡན་འདས་ བཅོམ་ ལྡན་འདས་ ལ་ དེ་བཞིན་ གཤེགས་པ་ ཡེ་ཤེས་ ཀྱི་ དཔལ་ གནོད་པ་ ཆུང་ ངམ །_ ཉམ་ང་བ་ ཉུང་ ངམ །_ བསྐྱོད་པ་ ཡང་ ངམ །_ སྟོབས་ དང་ བདེ་བ ར་ རེག་པ་ ལ་ གནས་ སམ་ ཞེས་ སྙུན་ གསོལ་ ཞིང་ །_
en: “Blessed One, the thus-gone Jñānaśrī inquires whether you have encountered but little hardship or discomfort, and whether you remain healthy, strong, and at ease.

source: བཅོམ་ལྡན་འདས་ ལ་ བཅོམ་ལྡན་འདས་ དེས་ ལག་པ་ ལྟ་བུ འི་ ཨུད་པ་ ལ་ འདི་ ཡང་ བསྐུར་ བ་ ལགས་ ན །_
en: He also offers you this hand-like utpala.

source: བཅོམ་ལྡན་འདས་ ཀྱིས་ ལག་པ་ ལྟ་བུ འི་ ཨུད་པ་ ལ་ དེ་ བཞེས་ ཏེ་ |#| བཞེས་ ནས་ |#| ཀྱང་ བཀའ་ སྩལ་པ །_
en: $389 The Blessed One received the hand-like utpala flower and asked,

source: རིགས་ ཀྱི་ བུ་ ཅི་ བཅོམ་ལྡན་འདས་ དེ་ སྙུན་ མི་ མངའ་ འམ །_ བདེ་བ ར་ གནས་ སམ །_། སྟོབས་ དང་ ལྡན་ ནམ །_ [64a] འགྱུར་བ་ མི་ མངའའམ །_
en: “Noble son, has that blessed one encountered but little harm, is he happy and strong, [64.a] and does he remain unchanged?”

source: དེ འི་ ཚེ་ ཤར་ཕྱོགས་ སུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ གྲངས་མེད་པ་ སུམ་ ཁྲི་ བཞི་ སྟོང་ འདས་པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ སྤོས་ བརྩེགས་ ཞེས་ བྱ་བ་ ཡོད་ དེ
en: $390 At that time there was in the east, beyond thirty-four thousand innumerable universes, a universe known as Display of Incense, and

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་ པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ ཙན་དན་ གྱི་ བསུང་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: within it resided a thus-gone one, a worthy one, a perfect buddha known as Sandalwood Fragrance .

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ དྲི་མ་ མེད་ ཅེས་བྱ་བ་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་ ཏོ །_།
en: This blessed one had prophesied that a bodhisattva known as Vimala would awaken to unsurpassable and perfect buddhahood.

source: བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ དྲི་མ་ མེད་ ཀྱིས་ སྣང་བ་ ཆེན་པོ་ དེ་ མཐོང་ སྟེ །_ |#| གསུང་ བསལ་བ འི་ སྒྲ་ དེ་ཡང་ ཐོས་ སོ །_།
en: Also this bodhisattva great being, Vimala , had noticed the great light and heard the sound of the clear voice.

source: བཅོམ་ལྡན་འདས་ སྣང་ བ་ དེ་ དང་ །_ གསུང་ བསལ་བ འི་ སྒྲ་ གྲག་པ་ དེ་ སུ འི་ ལགས །_
en: “Blessed One, whose is this radiance and clear voice?”

source: རིགས་ ཀྱི་ བུ་ ནུབ་ཕྱོགས་ ཀྱི་ ཕྱོགས་ཆ ར་ འཇིག་རྟེན་ གྱི་ ཁམས་ གྲངས་མེད་པ་ སུམ་ ཁྲི་ བཞི་ སྟོང་ འདས་པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ ཅེས་བྱ་བ་ ཡོད་ དེ
en: $391 Noble son,” |#| “thirty-four thousand innumerable universes to the west from here lies a universe known as Enduring.

source: འཚོ་ ཞིང་ གཞེས་ ལ་ འདི་ལྟ་སྟེ །_ |#| བྱང་ཆུབ་ སེམས་དཔ འི་ སྡེ་སྣོད་ སེམས་ཅན་ ཐམས་ཅད་ ཡང་དག་ པར་ ཚིམ་པ ར་ བྱེད་པ་ ཞེས་ བྱ་བ འི་ ཆོས་ ཀྱི་ རྣམ་ གྲངས་ ཀྱི་ ཆོས་ ཀྱང་ སྟོན་ ཏོ །_།
en: Abiding and remaining present there, he is delivering the Dharma teachings of the Bodhisattva Collection that are known as ‘Truly Satisfying All Sentient Beings.’ ”

source: བཅོམ་ལྡན་འདས་ བཅོམ་ལྡན་འདས་ དེ འི་ ཐད་ དུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ དེར་ བདག་ མཆི་བ ར་ བགྱི འོ །_།
en: “Blessed One, I wish to travel to that universe and go before that blessed one.”

source: དེ་ནས་ བཅོམ་ལྡན་འདས་ ཀྱིས་ བྱང་ཆུབ་ སེམས་དཔའ་ དྲི་མ་ མེད་ ཀྱི་ ལག་པ ར་ ཙན་དན་ གྱི་ ཐུམ་པོ་ བྱིན་ ཏེ
en: Then the thus-gone Sandalwood Fragrance placed a block of sandalwood in the bodhisattva Vimala ’s hand and said,

source: རིགས་ ཀྱི་ བུ་ ཁྱོད་ ཀྱིས་ བཅོམ་ལྡན་འདས་ དེ་ ལ་ ཙན་དན་ གྱི་ ཐུམ་པོ་ འདི་ ཕུལ་ ལ །_
en: “Noble son, offer this to that blessed one, and

source: ང འི་ ཚིག་ གིས་ བཅོམ་ལྡན་འདས་ བཅོམ་ལྡན་འདས་ ལ་ དེ་བཞིན་ གཤེགས་པ་ ཙན་དན་ གྱི་ བསུང་ གནོད་པ་ ཆུང་ ངམ །_ ཉམ་ང་བ་ ཉུང་ ངམ །_ བསྐྱོད་པ་ ཡང་ ངམ །_ [64b] སྟོབས་ དང་ བདེ་བ ར་ རེག་པ་ ལ་ གནས་ སམ །_ ཞེས་ སྙུན་ གསོལ་ ལོ་ ཞེས་ ཀྱང་ གསོལ་ ཅིག _།
en: ask him on my behalf whether he has encountered but little hardship or discomfort, and whether he remains healthy, [64.b] strong, and at ease.”

source: དེ་ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ དྲི་མ་ མེད་ བཅོམ་ལྡན་འདས་ དེ འི་ ཞབས་ ལ་མགོ་ བོས་ ཕྱག་ འཚལ་ ཏེ་ བསྐོར་བ་ བྱས་ ནས་
en: $394 The bodhisattva great being Vimala then bowed his head to the feet of that blessed one, circumambulated him, and left.

source: འདི་ལྟ་སྟེ །_ |#| དཔེར་ན་ སྐྱེས་བུ་ སྟོབས་ དང་ ལྡན་པ་ ཞིག་ གིས་ ལག་པ་ བསྐུམ་པ་ རྐྱོང་བ ར་ བྱེད་པ འམ །_ བརྐྱང་བ་ སྐུམ་པ ར་ བྱེད་པ འི་ སྐད་ཅིག་ དང་ །_ ཐང་ ཅིག་ དང་ །_ ཡུད་ཙམ་ དེས་ འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ འདིར་ འདུག་ གོ །_།
en: He then emerged all at once, in one instant and in one moment, in the world of Enduring, as fast as an athlete can stretch out or bend an arm.

source: དེ་ རྒྱལ་པོ འི་ ཁབ་ འོད་མ འི་ ཚལ་ བྱ་ ཀ་ ལན་ ད་ ཀ་ གནས་པ་ ག་ལ་བ་ དེར་ སོང་ སྟེ་ ཕྱིན་ ནས །_ |#| བཅོམ་ལྡན་ འདས་ ཀྱི་ ཞབས་ ལ་མགོ་ བོས་ ཕྱག་ འཚལ་ ཏེ་ ཕྱོགས་ གཅིག་ ཏུ་ འདུག་ གོ །_། |#| ཕྱོགས་ གཅིག་ ཏུ་ འདུག་ ནས་ ཀྱང་ བཅོམ་ལྡན་འདས་ ལ་ འདི་སྐད་ ཅེས་ གསོལ་ ཏོ །_།
en: He proceeded to Rājagṛha and the Kalandaka­nivāpa in the Veṇuvana, and there bowed his head to the feet of the Blessed One. |#| Standing to one side, he addressed the Blessed One:

source: བཅོམ་ལྡན་འདས་ བཅོམ་ལྡན་འདས་ ལ་ དེ་བཞིན་ གཤེགས་པ་ ཙན་དན་ གྱི་ བསུང་ གནོད་པ་ ཆུང་ ངམ །_ ཉམ་ང་བ་ ཉུང་ ངམ །_ བསྐྱོད་པ་ ཡང་ ངམ །_ སྟོབས་ དང་ བདེ་བ ར་ རེག་པ་ ལ་ གནས་ སམ །_ ཞེས་ སྙུན་ གསོལ་ ཞིང་ །_
en: “Blessed One, the thus-gone Sandalwood Fragrance inquires whether you have encountered but little hardship or discomfort, and whether you remain healthy, strong, and at ease.

source: བཅོམ་ལྡན་འདས་ ལ་ བཅོམ་ལྡན་འདས་ དེས་ ཙན་དན་ གྱི་ ཐུམ་པོ་ འདི་ ཡང་ བསྐུར་བ་ ལགས་ ན་ ཙན་དན་ གྱི་ ཐུམ་པོ་ འདི་ བཅོམ་ལྡན་འདས་ ཀྱིས་ བཞེས་ སུ་ གསོལ །_
en: He also sends you this block of sandalwood. |#| Blessed One, please accept it.”

source: བཅོམ་ལྡན་འདས་ ཀྱིས་ བཞེས་ ཏེ་ |#| བཞེས་ ནས་ |#| ཀྱང་ །_ བཅོམ་ལྡན་འདས་ ཀྱིས་ བྱང་ཆུབ་ སེམས་དཔའ་ དྲི་མ་ མེད་ ལ་ བཀའ་ སྩལ་པ །_
en: $395 The Blessed One received the gift and asked,

source: རིགས་ ཀྱི་ བུ་ ཅི་ བཅོམ་ལྡན་འདས་ དེ་ སྙུན་ མི་ མངའ་ འམ །_ སྟོབས་ དང་ ལྡན་ ནམ །_ འགྱུར་བ་ མི་ མངའ་ འམ །_ བདེ་བ ར་ རེག་པ་ ལ་ གནས་ སམ །_
en: “Noble son, is that blessed one free from harm, is he strong, and does he remain unchanged and at ease?”

source: བཅོམ་ ལྡན་འདས་ སྙུན་ མི་ མངའ་ ཞིང་ སྟོབས་ དང་ ལྡན་ ལ །_ འགྱུར་བ་ མི་ མངའ་ སྟེ |#| བདེ་བ ར་ གནས་ ལགས་སོ །_།
en: $396 “Yes indeed,” |#| “he is free from harm and is strong and unchanged. |#| He remains at ease.”

source: དེ འི་ ཚེ་ ཤར་ཕྱོགས་ སུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ གྲངས་མེད་པ་ སུམ་ ཁྲི་ སུམ་ སྟོང་ འདས་པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ དྲི་ འདས་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $397 At that time there was in the east, beyond thirty-three thousand innumerable universes, a universe known as Beyond Stain, and
